# UndefinedConnector Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..UndefinedConnector Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
Revit does not support Undefined connectors. The following have been replaced by the default connector: [Connector Element]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UndefinedConnector { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UndefinedConnector As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UndefinedConnector {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace